DiverOfDark/pipecat-voice-assistant/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU @ 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 8 MB flash (XIAO ESP32-S3)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 8 MB octal PSRAM (XIAO ESP32-S3)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# FreeRTOS — bump task stack a bit; WebRTC + Opus need headroom
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Compiler — let -O2 ride; size-optimized hurts Opus too much
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TLS — bundle the standard public-CA roots so HTTPS to the backend works
# without per-deployment cert pinning. Full bundle is ~80 KB.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
